#### Terraform Plan 📖`success`
#### `Plan: 5 to add, 6 to change, 0 to destroy.`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Stromweld/tf_repo_manager/runs/run-rCB95TSVDykHsRTm

Waiting for the plan to start...

Terraform v1.3.5
on linux_amd64
Initializing plugins and modules...
module.other_repos.module.looper["github-workflows"].module.repository.github_repository.this: Refreshing state... [id=github-workflows]
module.other_repos.module.looper["chef-repo"].module.repository.github_repository.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["kickstart"].module.repository.github_repository.this: Refreshing state... [id=kickstart]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-workspaces]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_repository.this: Refreshing state... [id=aws_temp_saml_creds]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_repository.this: Refreshing state... [id=tf_repo_manager]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_repository.this: Refreshing state... [id=terraform-github-repositories]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_repository.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-private-modules]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_repository.this: Refreshing state... [id=chef_automate_ha]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_collectd_ii]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this: Refreshing state... [id=chef_timezone_iii]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_repository.this: Refreshing state... [id=chef_base_config]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_repository.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_autopatch_ii]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_repository.this: Refreshing state... [id=chef_base_role]
tfe_oauth_client.github: Refreshing state... [id=oc-My3Z8GgnzemkfQKc]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["chef-repo"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["kickstart"].module.repository.data.github_branch.main: Reading...
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.data.github_branch.main: Read complete after 0s [id=tf_repo_manager:main]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["chef-repo"].module.repository.data.github_branch.main: Read complete after 0s [id=chef-repo:main]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.data.github_branch.main: Read complete after 0s [id=aws_temp_saml_creds:main]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["kickstart"].module.repository.data.github_branch.main: Read complete after 1s [id=kickstart:main]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-tfe-workspaces:TOKEN_TFC]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-tfe-private-modules:TOKEN_TFC]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_actions_secret.this["TOKEN_TFC"]: Refreshing state... [id=terraform-github-repositories:TOKEN_TFC]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_default.this: Refreshing state... [id=tf_repo_manager]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHSeHTM4Bh7gF]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.data.github_branch.main: Reading...
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.data.github_branch.main: Read complete after 1s [id=Chef_AD_DNS_Solarwinds_Spacewalk:main]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.data.github_branch.main: Read complete after 1s [id=terraform-github-repositories:main]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.data.github_branch.main: Read complete after 1s [id=terraform-tfe-private-modules:main]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.data.github_branch.main: Read complete after 0s [id=terraform-tfe-workspaces:main]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository_collaborator.this["limitusus"]: Refreshing state... [id=chef_timezone_iii:limitusus]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_artifactory_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_base_role:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_automate_ha:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_base_config:main]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_autopatch_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_base_role:main]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_base_config:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_chef_software:main]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_collectd_ii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_collectd_ii:main]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_chef_software:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_artifactory_ii:main]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"]: Refreshing state... [id=chef_timezone_iii:SUPERMARKET_KEY]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Read complete after 2s [id=chef_autopatch_ii:main]
module.tf_repo_manager.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace: Refreshing state... [id=ws-sKUnXifAZaTLrKVo]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-mHz65UZ77CqY4nFa]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-bjcjq8rHd2mYxoSq]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-cePnVEzzY2MwYRNw]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_default.this: Refreshing state... [id=aws_temp_saml_creds]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_default.this: Refreshing state... [id=github-workflows]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_default.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_default.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_default.this: Refreshing state... [id=kickstart]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwbc4BiWy2]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCW9ReM4Bh7gC]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOBP18Nc4Bh7f_]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOFQgqW84Bh7gA]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbdKjM4Bh7f-]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwe84BiWy6]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwQ84BiWy1]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwT84BiWy3]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-workspaces]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-github-repositories]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-private-modules]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE3]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOIhNU984B34HL]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzU5Mzgw]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE1]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY0NzAy]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbOQcM4Bh7gD]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_branch_default.this: Refreshing state... [id=chef_automate_ha]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_autopatch_ii]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_config]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_role]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_default.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_collectd_ii]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_timezone_iii]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_automate_ha"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_automate_ha"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ has_projects                = true -> false
        id                          = "chef_automate_ha"
        name                        = "chef_automate_ha"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_autopatch_ii"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
      ~ enforce_admins                  = false -> true
        id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY0NzAy"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_chef_software"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_protection.default["main"] will be updated in-place
  ~ resource "github_branch_protection" "default" {
      ~ enforce_admins                  = false -> true
        id                              = "BPR_kwDOCbOQcM4Bh7gD"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "chef_timezone_iii"
      + sha        = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "chef_timezone_iii"
        name                        = "chef_timezone_iii"
      ~ vulnerability_alerts        = false -> true
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.other_repos.module.looper["github-org-collaborators"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "github-org-collaborators"
      + sha        = (known after apply)
    }

  # module.other_repos.module.looper["github-org-collaborators"].module.repository.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + rename     = false
      + repository = "github-org-collaborators"
    }

  # module.other_repos.module.looper["github-org-collaborators"].module.repository.github_branch_protection.default["main"] will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_last_push_approval      = false
          + required_approving_review_count = 0
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "check",
            ]
          + strict   = true
        }
    }

  # module.other_repos.module.looper["github-org-collaborators"].module.repository.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Ruby script to generate csv file of outside collaborators per repo in org"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "github-org-collaborators"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "managed-by-terraform",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.other_repos.module.looper["github-workflows"].module.repository.data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "github-workflows"
      + sha        = (known after apply)
    }

  # module.other_repos.module.looper["github-workflows"].module.repository.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      - allow_update_branch         = true -> null
        id                          = "github-workflows"
        name                        = "github-workflows"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tf_repo_manager.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace will be updated in-place
  ~ resource "tfe_workspace" "workspace" {
        id                            = "ws-sKUnXifAZaTLrKVo"
        name                          = "tf_repo_manager"
      ~ terraform_version             = "1.3.5" -> "1.5.0"
        # (20 unchanged attributes hidden)
    }

Plan: 5 to add, 6 to change, 0 to destroy.


```

</details>

*Pushed by: @Stromweld, Action: `pull_request`*